<h4>天干地支年份練習-1</h4>
<hr>
<?php
    $start=1024;
    $sky=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
    $ground=["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];

    $year=2025;
    $arr=[];
    for($i=1024;$i<3000;$i++){
        $arr[$i]=$sky[($i%10+6)%10] . $ground[($i%12+8)%12];
    }

    echo "<pre>";print_r($arr);echo "</pre>";

    echo $year . "是" . $arr[$year] . "年";

?>

<hr>
<h4>天干地支年份練習-2</h4>
<?php

$sky=["庚","辛","壬","癸","甲","乙","丙","丁","戊","己",];
$ground=["申","酉","戌","亥","子", "丑", "寅", "卯", "辰","巳", "午","未"];

$year=2023;

$arr=[];
for($i=1024;$i<3000;$i++){
    $arr[$i]=$sky[$i%10] . $ground[$i%12];
}

echo "<pre>";print_r($arr);echo "</pre>";

echo $year . "是" . $arr[$year] . "年";



?>