<?php
//學生成績資料
$score=[
    "01"=>[
        "國文"=>95,"英文"=>64,"數學"=>70,"地理"=>90,"歷史"=>84
    ],
    "03"=>[
        "國文"=>88,"英文"=>78,"數學"=>54,"地理"=>81,"歷史"=>71
    ],
    "05"=>[
        "國文"=>45,"英文"=>60,"數學"=>68,"地理"=>70,"歷史"=>62
    ],
    "07"=>[
        "國文"=>59,"英文"=>32,"數學"=>77,"地理"=>54,"歷史"=>42
    ],
    "09"=>[
        "國文"=>71,"英文"=>62,"數學"=>80,"地理"=>62,"歷史"=>64
    ],
];
if(isset($_GET['num'])){
    $num=$_GET['num'];
    echo "座號:".$num."的成績:<br>";
    echo "國文成績:".$score[$num]["國文"]."分<br>";
    echo "英文成績:".$score[$num]["英文"]."分<br>";
    echo "數學成績:".$score[$num]["數學"]."分<br>";
    echo "地理成績:".$score[$num]["地理"]."分<br>";
    echo "歷史成績:".$score[$num]["歷史"]."分<br>";
    
}else{
    echo "<span style='font-weight:border;color:red'>!!請提供座號</span>";

}
?>
<a href="student2y.html">回學生列表</a>