<?php
/*3. 假設這期的統一發票中獎號碼為01272636、39412201、94586356。
請設計一程式讓使用者輸入一組發票號碼即可印出中獎金額。
(其中末三碼相同獎金200元；末四碼相同獎金1000元；
末五碼相同獎金4000元；末六碼相同獎金10000元；
末七碼相同獎金40000元；號碼全部相同獎金200000元。 
*/
header("Content-Type:text/html; charset=utf-8");
if(isset($_GET['n'])) $n=$_GET['n'];
else $n='09824636'; 

$R1[0]='01272636'; $R1[1]='39412201'; $R1[2]='94586356'; //發票中獎號碼
//中獎金額
$i=0; $M[$i]=200000;
$i++; $M[$i]=40000;
$i++; $M[$i]=10000;
$i++; $M[$i]=4000;
$i++; $M[$i]=1000;
$i++; $M[$i]=200;

$i=0; $L[$i]=8;
$i++; $L[$i]=7;
$i++; $L[$i]=6;
$i++; $L[$i]=5;
$i++; $L[$i]=4;
$i++; $L[$i]=3;

$m=0;
for($r1=0;$r1<count($R1);$r1++){ //發票中獎號碼
for($l=0;$l<count($L);$l++){//你的發票末幾碼
if( (int)Str_last_n($R1[$r1],$L[$l]) == (int)Str_last_n($n,$L[$l]) ) {
$m=$m+$M[$l];
break;
}
}	
}

printf("中獎金額%d",$m);

function Str_last_n($S,$n){
$R = str_split($S);
$r="";
for($i=count($R)-$n;$i<count($R);$i++) {
$r=$r.$R[$i];
}
return $r;
}


?>